'use strict';
(function () {
    var db = {
        loadData: function (filter) {
            return $.grep(this.clients, function (client) {
                return (!filter.Name || client.Name.indexOf(filter.Name) > -1) &&
                    (!filter.Action || client.Action === filter.Action) &&
                    (!filter.Addedby || client.Addedby.indexOf(filter.Addedby) > -1) &&
                    (!filter.vendortype || client.vendortype === filter.vendortype) &&
                    (filter.Married === undefined || client.Married === filter.Married);
            });
        },
        insertItem: function (insertingClient) {
            this.clients.push(insertingClient);
        },
        updateItem: function (updatingClient) {},

        deleteItem: function (deletingClient) {
            var clientIndex = $.inArray(deletingClient, this.clients);
            this.clients.splice(clientIndex, 1);
        }
    };
    window.db = db;
    db.countries = [{
            Name: "India",
            Id: 0
        },
        {
            Name: "United States",
            Id: 1
        },
        {
            Name: "Canada",
            Id: 2
        },
        {
            Name: "United Kingdom",
            Id: 3
        },
        {
            Name: "France",
            Id: 4
        },
        {
            Name: "Brazil",
            Id: 5
        },
        {
            Name: "China",
            Id: 6
        },
        {
            Name: "Russia",
            Id: 7
        }
    ];
    db.clients = [

        {
            "شماره": "1",
            "فاکتور": "50764",
            "تاریخ": "1399/01/11",
            "هزینه ارسال": "3,620",
            "مبلغ": "816,000",
            "مالیات": "65,280",
            "جمع کل": "884,160",
        },
        {
            "شماره": "2",
            "فاکتور": "50765",
            "تاریخ": "1399/03/12",
            "هزینه ارسال": "8,400",
            "مبلغ": "146,000",
            "مالیات": "70,000",
            "جمع کل": "225,400",
        },

        {
            "شماره": "3",
            "فاکتور": "50766",
            "تاریخ": "1399/04/09",
            "هزینه ارسال": "7,300",
            "مبلغ": "47,000",
            "مالیات": "724,000",
            "جمع کل": "789,000",
        },
        {
            "شماره": "4",
            "فاکتور": "50767",
            "تاریخ": "1399/04/23",
            "هزینه ارسال": "2,000",
            "مبلغ": "478,000",
            "مالیات": "35,000",
            "جمع کل": "512,000",
        },
        {
            "شماره": "5",
            "فاکتور": "50768",
            "تاریخ": "1399/05/14",
            "هزینه ارسال": "1,500",
            "مبلغ": "1460,000",
            "مالیات": "45,320",
            "جمع کل": "1515,000",
        },
        {
            "شماره": "6",
            "فاکتور": "50769",
            "تاریخ": "1399/05/22",
            "هزینه ارسال": "8,450",
            "مبلغ": "768,000",
            "مالیات": "17,000",
            "جمع کل": "780,000",
        },
        {
            "شماره": "7",
            "فاکتور": "50770",
            "تاریخ": "1399/05/10",
            "هزینه ارسال": "25,800",
            "مبلغ": "874,000",
            "مالیات": "27,200",
            "جمع کل": "945,100",
        },
        {
            "شماره": "8",
            "فاکتور": "50771",
            "تاریخ": "1399/05/07",
            "هزینه ارسال": "17,200",
            "مبلغ": "671,000",
            "مالیات": "83,700",
            "جمع کل": "775,900",
        },
        {
            "شماره": "9",
            "فاکتور": "50772",
            "تاریخ": "1399/05/16",
            "هزینه ارسال": "87,500",
            "مبلغ": "572,000",
            "مالیات": "8,700",
            "جمع کل": "615,000",
        },
        {
            "شماره": "10",
            "فاکتور": "50773",
            "تاریخ": "1399/05/29",
            "هزینه ارسال": "78,120",
            "مبلغ": "489,000",
            "مالیات": "10,570",
            "جمع کل": "516,000",
        },
        {
            "شماره": "11",
            "فاکتور": "50774",
            "تاریخ": "1399/05/31",
            "هزینه ارسال": "57,560",
            "مبلغ": "800,000",
            "مالیات": "78,200",
            "جمع کل": "975,000",
        },
        {
            "شماره": "12",
            "فاکتور": "50775",
            "تاریخ": "1399/05/15",
            "هزینه ارسال": "40,170",
            "مبلغ": "867,000",
            "مالیات": "57,200",
            "جمع کل": "945,000",
        },
        {
            "شماره": "13",
            "فاکتور": "50776",
            "تاریخ": "1399/05/27",
            "هزینه ارسال": "80,040",
            "مبلغ": "478,200",
            "مالیات": "47,500",
            "جمع کل": "535,400",
        },
        {
            "شماره": "14",
            "فاکتور": "50777",
            "تاریخ": "1399/05/02",
            "هزینه ارسال": "6,150",
            "مبلغ": "576,000",
            "مالیات": "4,480",
            "جمع کل": "599,000",
        },
        {
            "شماره": "15",
            "فاکتور": "50778",
            "تاریخ": "1399/05/14",
            "هزینه ارسال": "8,670",
            "مبلغ": "875,000",
            "مالیات": "56,780",
            "جمع کل": "987,000",
        },
        {
            "شماره": "16",
            "فاکتور": "50779",
            "تاریخ": "1399/06/08",
            "هزینه ارسال": "7,880",
            "مبلغ": "547,000",
            "مالیات": "5,720",
            "جمع کل": "600,000",
        },
        {
            "شماره": "17",
            "فاکتور": "50780",
            "تاریخ": "1399/06/26",
            "هزینه ارسال": "3,140",
            "مبلغ": "781,000",
            "مالیات": "23,470",
            "جمع کل": "817,000",
        },

        {
            "شماره": "18",
            "فاکتور": "50781",
            "تاریخ": "1399/06/19",
            "هزینه ارسال": "7,300",
            "مبلغ": "47,000",
            "مالیات": "724,000",
            "جمع کل": "789,000",
        },
        {
            "شماره": "19",
            "فاکتور": "50782",
            "تاریخ": "1399/06/01",
            "هزینه ارسال": "2,000",
            "مبلغ": "478,000",
            "مالیات": "35,000",
            "جمع کل": "512,000",
        },
        {
            "شماره": "20",
            "فاکتور": "50783",
            "تاریخ": "1399/06/30",
            "هزینه ارسال": "1,500",
            "مبلغ": "146,000",
            "مالیات": "45,320",
            "جمع کل": "151,500",
        },
        {
            "شماره": "21",
            "فاکتور": "50784",
            "تاریخ": "1399/06/17",
            "هزینه ارسال": "8,450",
            "مبلغ": "768,000",
            "مالیات": "17,000",
            "جمع کل": "780,000",
        },
        {
            "شماره": "22",
            "فاکتور": "50785",
            "تاریخ": "26/06/12",
            "هزینه ارسال": "25,800",
            "مبلغ": "874,000",
            "مالیات": "1399,200",
            "جمع کل": "945,100",
        },
        {
            "شماره": "23",
            "فاکتور": "50786",
            "تاریخ": "1399/06/29",
            "هزینه ارسال": "17,200",
            "مبلغ": "671,000",
            "مالیات": "83,700",
            "جمع کل": "775,900",
        },
        {
            "شماره": "24",
            "فاکتور": "50787",
            "تاریخ": "1399/06/26",
            "هزینه ارسال": "87,500",
            "مبلغ": "572,000",
            "مالیات": "8,7000",
            "جمع کل": "615,000",
        },

    ];
    db.users = [{
            "ID": "x",
            "Account": "A758A693-0302-03D1-AE53-EEFE22855556",
            "Name": "Carson Kelley",
            "RegisterDate": "2002-04-20T22:55:52-07:00"
        },
        {
            "Account": "D89FF524-1233-0CE7-C9E1-56EFF017A321",
            "Name": "Prescott Griffin",
            "RegisterDate": "2011-02-22T05:59:55-08:00"
        },
        {
            "Account": "06FAAD9A-5114-08F6-D60C-961B2528B4F0",
            "Name": "Amir Saunders",
            "RegisterDate": "2014-08-13T09:17:49-07:00"
        },
        {
            "Account": "EED7653D-7DD9-A722-64A8-36A55ECDBE77",
            "Name": "Derek Thornton",
            "RegisterDate": "2012-02-27T01:31:07-08:00"
        },
        {
            "Account": "2A2E6D40-FEBD-C643-A751-9AB4CAF1E2F6",
            "Name": "Fletcher Romero",
            "RegisterDate": "2010-06-25T15:49:54-07:00"
        },
        {
            "Account": "3978F8FA-DFF0-DA0E-0A5D-EB9D281A3286",
            "Name": "Thaddeus Stein",
            "RegisterDate": "2013-11-10T07:29:41-08:00"
        },
        {
            "Account": "658DBF5A-176E-569A-9273-74FB5F69FA42",
            "Name": "Nash Knapp",
            "RegisterDate": "2005-06-24T09:11:19-07:00"
        },
        {
            "Account": "76D2EE4B-7A73-1212-F6F2-957EF8C1F907",
            "Name": "Quamar Vega",
            "RegisterDate": "2011-04-13T20:06:29-07:00"
        },
        {
            "Account": "00E46809-A595-CE82-C5B4-D1CAEB7E3E58",
            "Name": "Philip Galloway",
            "RegisterDate": "2008-08-21T18:59:38-07:00"
        },
        {
            "Account": "C196781C-DDCC-AF83-DDC2-CA3E851A47A0",
            "Name": "Mason French",
            "RegisterDate": "2000-11-15T00:38:37-08:00"
        },
        {
            "Account": "5911F201-818A-B393-5888-13157CE0D63F",
            "Name": "Ross Cortez",
            "RegisterDate": "2010-05-27T17:35:32-07:00"
        },
        {
            "Account": "B8BB78F9-E1A1-A956-086F-E12B6FE168B6",
            "Name": "Logan King",
            "RegisterDate": "2003-07-08T16:58:06-07:00"
        },
        {
            "Account": "06F636C3-9599-1A2D-5FD5-86B24ADDE626",
            "Name": "Cedric Leblanc",
            "RegisterDate": "2011-06-30T14:30:10-07:00"
        },
        {
            "Account": "FE880CDD-F6E7-75CB-743C-64C6DE192412",
            "Name": "Simon Sullivan",
            "RegisterDate": "2013-06-11T16:35:07-07:00"
        },
        {
            "Account": "BBEDD673-E2C1-4872-A5D3-C4EBD4BE0A12",
            "Name": "Jamal West",
            "RegisterDate": "2001-03-16T20:18:29-08:00"
        },
        {
            "Account": "19BC22FA-C52E-0CC6-9552-10365C755FAC",
            "Name": "Hector Morales",
            "RegisterDate": "2012-11-01T01:56:34-07:00"
        },
        {
            "Account": "A8292214-2C13-5989-3419-6B83DD637D6C",
            "Name": "Herrod Hart",
            "RegisterDate": "2008-03-13T19:21:04-07:00"
        },
        {
            "Account": "0285564B-F447-0E7F-EAA1-7FB8F9C453C8",
            "Name": "Clark Maxwell",
            "RegisterDate": "2004-08-05T08:22:24-07:00"
        },
        {
            "Account": "EA78F076-4F6E-4228-268C-1F51272498AE",
            "Name": "Reuben Walter",
            "RegisterDate": "2011-01-23T01:55:59-08:00"
        },
        {
            "Account": "6A88C194-EA21-426F-4FE2-F2AE33F51793",
            "Name": "Ira Ingram",
            "RegisterDate": "2008-08-15T05:57:46-07:00"
        },
        {
            "Account": "4275E873-439C-AD26-56B3-8715E336508E",
            "Name": "Damian Morrow",
            "RegisterDate": "2015-09-13T01:50:55-07:00"
        },
        {
            "Account": "A0D733C4-9070-B8D6-4387-D44F0BA515BE",
            "Name": "Macon Farrell",
            "RegisterDate": "2011-03-14T05:41:40-07:00"
        },
        {
            "Account": "B3683DE8-C2FA-7CA0-A8A6-8FA7E954F90A",
            "Name": "Joel Galloway",
            "RegisterDate": "2003-02-03T04:19:01-08:00"
        },
        {
            "Account": "01D95A8E-91BC-2050-F5D0-4437AAFFD11F",
            "Name": "Rigel Horton",
            "RegisterDate": "2015-06-20T11:53:11-07:00"
        },
        {
            "Account": "F0D12CC0-31AC-A82E-FD73-EEEFDBD21A36",
            "Name": "Sylvester Gaines",
            "RegisterDate": "2004-03-12T09:57:13-08:00"
        },
        {
            "Account": "874FCC49-9A61-71BC-2F4E-2CE88348AD7B",
            "Name": "Abbot Mckay",
            "RegisterDate": "2008-12-26T20:42:57-08:00"
        },
        {
            "Account": "B8DA1912-20A0-FB6E-0031-5F88FD63EF90",
            "Name": "Solomon Green",
            "RegisterDate": "2013-09-04T01:44:47-07:00"
        }
    ];
}());